Repository: capstanlqc-mtpe/CIDQ_BillingCode2026_fr-CA_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr_ca

source: Audible and visible alarm signals associated with a gas detection alarm shall be distinct from fire alarm and carbon monoxide alarm signals.
fr_ca: Les signaux d’alarme sonores et visuels associés à une alarme de détection de gaz doivent être distincts des signaux d’alarme d’incendie et des signaux d’alarme de monoxyde de carbone.

source: Audible signals shall have a frequency of 1500 Hz maximum.
fr_ca: Les signaux sonores doivent avoir une fréquence maximale de 1500 Hz.

source: Auditoriums, cafeterias, gymnasiums and similar areas are protected by heat detectors or other approved detection devices.
fr_ca: Les auditoriums, les cafétérias, les gymnases et les aires similaires sont protégés par des détecteurs de chaleur ou d’autres dispositifs de détection approuvés.

source: Automatic doors shall comply with Section 404.3.
fr_ca: Les portes automatiques doivent être conformes à la section 404.3.

source: Automatic fire detection systems.
fr_ca: Systèmes automatiques de détection d'incendie.

source: Automatic sprinkler systems shall comply with this section.
fr_ca: Les systèmes d'extincteurs automatiques doivent être conformes à la présente section.

source: Automatic sprinklers are provided along both sides of the separation wall and doors, or on the room side only if there is not a walkway on the atrium side.
fr_ca: Des gicleurs automatiques sont prévus des deux côtés du mur de séparation et des portes, ou du côté de la pièce seulement s’il n’y a pas de passerelle du côté de l’atrium.

source: Automotive lifts
fr_ca: Élévateurs automobiles

source: Balconies or stories within Groups A-1, A-4 and A-5 and mezzanines that comply with Section 505 shall not be considered a story as it applies to this section
fr_ca: Les balcons ou les étages des groupes A-1, A-4 et A-5 et les mezzanines qui sont conformes à la section 505 ne sont pas considérés comme un étage aux fins de la présente section

source: Balconies, decks, and porches that are accessible from inside of the dwelling unit shall have at least one receptacle outlet installed within the perimeter of the balcony, deck, or porch.
fr_ca: Les balcons, les terrasses et les porches accessibles depuis l'intérieur de l'unité d'habitation doivent avoir au moins une prise de courant installée dans le périmètre du balcon, de la terrasse ou du porche.

source: Baptisteries, ornamental and lily pools, aquariums, ornamental fountain basins, swimming pools, and similar constructions, where provided with water supplies, shall be protected against backflow in accordance with Section 608.
fr_ca: Les baptistères, les bassins ornementaux et à nénuphars, les aquariums, les bassins de fontaines ornementales, les piscines et les constructions similaires, lorsqu'ils sont pourvus d'alimentations en eau, doivent être protégés contre le refoulement selon la section 608.

source: Barriers shall be constructed so that the barrier prevents the passage of a 4-inch (100 mm) diameter sphere where any portion of the sphere is within 4 inches (100 mm) of the floor.
fr_ca: Les barrières doivent être construites de manière à empêcher le passage d'une sphère de 4 po [100 mm] de diamètre lorsque toute partie de la sphère se trouve à moins de 4 po [100 mm] du sol.

source: Barriers shall be constructed so that the barrier prevents the passage of a 4-inch-diameter (102 mm) sphere, where any portion of the sphere is within 4 inches (102 mm) of the floor or ground surface.
fr_ca: Les barrières doivent être construites de manière à empêcher le passage d’une sphère de 4 pouces (102 mm) de diamètre lorsque toute partie de la sphère se trouve à moins de 4 pouces (102 mm) de la surface du plancher ou du sol.

source: Basements and sleeping rooms below the fourth story above grade plane shall have not fewer than one emergency escape and rescue opening in accordance with this section.
fr_ca: Les sous-sols et les chambres à coucher situés au-dessous du quatrième étage au-dessus du plan de référence doivent avoir au moins une ouverture d'évacuation et de sauvetage d'urgence conformément à la présente section.

source: Bathrooms, toilet rooms and laundry rooms shall have a ceiling height of not less than 6 feet 8 inches (2032 mm).
fr_ca: La hauteur de plafond dans les salles de bain, les toilettes et les buanderies ne doit pas être inférieure à 6 pi-8 po [2032 mm].

source: Bathrooms, toilet rooms, kitchens, storage rooms and laundry rooms shall have a ceiling height of not less than 7 feet (2134 mm) above the finished floor.
fr_ca: La hauteur de plafond dans les salles de bain, les toilettes, les cuisines, les pièces d'entreposage et les buanderies ne doit pas être inférieure à 7 pi (2134 mm) au-dessus du sol fini.

source: Bathrooms, water closet compartments and other similar rooms shall be provided with aggregate glazing area in windows of not less than 3 square feet (0.3 m2), one-half of which shall be openable.
fr_ca: Les salles de bains, les cabinets d’aisances et les autres pièces similaires doivent être pourvus de fenêtres dont la superficie vitrée totale est d’au moins 3 pi2 (0,3 m2), dont la moitié doit être ouvrante.

source: Bathtub and shower floors and walls above bathtubs with installed shower heads and in shower compartments shall be finished with a nonabsorbent surface.
fr_ca: Les planchers de baignoire et de douche et les murs au-dessus des baignoires avec des têtes de mur de douche installées et dans les compartiments de douche doivent être revêtus d'une surface non absorbante.

source: Bathtub floors, shower floors, wall areas above built-in tubs that have installed shower heads and walls in shower compartments shall be constructed of smooth, corrosion-resistant and nonabsorbent waterproof materials.
fr_ca: Les planchers de baignoire, les planchers de douche, les surfaces de mur au-dessus des baignoires encastrées munies de têtes de douche installées et les murs des compartiments de douche doivent être construits en matériaux imperméables lisses, résistants à la corrosion et non absorbants.

source: Bathtubs shall be equipped with a waste outlet that is not less than 11/2 inches (38 mm) in diameter.
fr_ca: Les baignoires doivent être équipées d'une évacuation d'au moins 11/2 po [38 mm] de diamètre.

source: Bathtubs shall comply with Section 607.
fr_ca: Les baignoires doivent être conformes à la section 607.

source: Bathtubs shall conform to ASME A112.19.1/CSA B45.2, ASME A112.19.2/CSA B45.1, ASME A112.19.3/CSA B45.4 or CSA B45.5/IAPMO Z124.
fr_ca: Les baignoires doivent être conformes aux normes ASME A112.19.1/CSA B45.2, ASME A112.19.2/CSA B45.1, ASME A112.19.3/CSA B45.4 ou CSA B45.5/IAPMO Z124.

source: Bathtubs shall deliver water that is 120°F (49°C) maximum.
fr_ca: Les baignoires doivent fournir de l'eau à une température maximale de 120 °F (49 °C).

source: Be accompanied by construction documents and other information as required in Section 107.
fr_ca: Être accompagnée des documents de construction et des autres renseignements exigés à l’article 107.

source: Be signed by the applicant, or the applicant's authorized agent.
fr_ca: Être signée par le demandeur ou son agent autorisé.

source: Beams designed only for the attachment of portable or fixed theater equipment, gridirons, galleries and catwalks shall be constructed of approved materials consistent with the requirements for the type of construction of the building; and a fire-resistance rating shall not be required.
fr_ca: Les poutres conçues uniquement pour la fixation d’équipements de théâtre portatifs ou fixes, de grils, de passerelles et de passerelles suspendues doivent être construites avec des matériaux approuvés conformes aux exigences applicables au type de construction du bâtiment; une résistance au feu n’est pas requise.

source: Bedrooms in Group R-4 facilities shall be counted as sleeping units for the purpose of determining the number of units.
fr_ca: Les chambres à coucher dans les installations du groupe R-4 doivent être comptées comme des unités de couchage aux fins de la détermination du nombre d'unités.

source: Bedrooms in monasteries and convents shall be counted as units for the purpose of determining the number of units.
fr_ca: Les chambres à coucher des monastères et des couvents doivent être comptées comme des unités aux fins de la détermination du nombre d’unités.

source: Bedrooms within congregate living facilities, dormitories, sororities, fraternities and boarding houses shall be counted as sleeping units for the purpose of determining the number of units.
fr_ca: Les chambres à coucher des établissements de vie collective, des dortoirs, des résidences universitaires pour femmes, des résidences universitaires pour hommes et des pensions doivent être comptées comme des unités de couchage aux fins de la détermination du nombre d’unités.

source: Bedrooms within congregate living facilities, dormitories, sororities, fraternities, and boarding houses shall be counted as sleeping units for the purpose of determining the number of units.
fr_ca: Les chambres à coucher des établissements de vie collective, des dortoirs, des résidences universitaires pour femmes, des résidences universitaires pour hommes et des pensions doivent être comptées comme des unités de couchage aux fins de la détermination du nombre d’unités.

source: Before issuing a permit, the building official is authorized to examine or cause to be examined buildings, structures and sites for which an application has been filed.
fr_ca: Avant de délivrer un permis, le responsable de la construction est autorisé à examiner ou à faire examiner les bâtiments, les structures et les sites pour lesquels une demande a été déposée.

source: Belt manlifts
fr_ca: Monte-personnes à courroie

source: Bidets shall conform to ASME A112.19.2/CSA B45.1 or ASME A112.19.3/CSA B45.4.
fr_ca: Les bidets doivent être conformes à la norme ASME A112.19.2/CSA B45.1 ou ASME A112.19.3/CSA B45.4.

source: Bleachers, grandstands and folding and telescopic seating, that are not building elements, shall comply with ICC 300.
fr_ca: Les gradins, les tribunes et les sièges pliants et télescopiques, qui ne sont pas des éléments de construction, doivent être conformes à l'ICC 300.

source: Boarding houses (nontransient)
fr_ca: Pensions de famille (permanentes)

source: Boarding houses (transient)
fr_ca: Pensions de famille (de courte durée)

source: Boarding houses (transient) with more than 10 occupants
fr_ca: Pensions de famille (de courte durée) de plus de 10 occupants

source: Bolts
fr_ca: Boulons

source: Bond beams
fr_ca: Poutres de liaison

source: Bottom hinged door ovens shall have a countertop positioned adjacent to one side of the door.
fr_ca: Les fours à porte à charnières inférieures doivent avoir un comptoir placé à côté d'un côté de la porte.

source: Bottom-hinged appliance doors, when in the open position, shall not be required to comply with Section 309.3.
fr_ca: Les portes d'appareils à charnières inférieures, lorsqu'elles sont en position ouverte, ne sont pas tenues de se conformer à la section 309.3.

source: Bottom-hinged door ovens shall have a work surface complying with Section 804.3 positioned adjacent to one side of the door.
fr_ca: Les fours à porte à charnières inférieures doivent avoir une surface de travail conforme à la section 804.3 positionnée à côté d'un côté de la porte.

source: Braille dots shall have a domed or rounded shape and shall comply with Table 703.4.3.
fr_ca: Les points en braille doivent avoir une forme bombée ou arrondie et être conformes au Tableau 703.4.3.

source: Braille provided on elevator car controls shall be separated 3/16 inch (4.8 mm) minimum either directly below or adjacent to the corresponding raised characters or symbols.
fr_ca: Le braille prévu sur les commandes de la cabine d'ascenseur doit être séparé d'au moins 3/16 po [4,8 mm] des caractères ou symboles en relief correspondants, soit directement en dessous, soit à côté.

source: Braille shall be 48 inches (1220 mm) minimum and 60 inches (1525 mm) maximum above the floor, measured to the baseline of the braille cells.
fr_ca: Le braille doit se trouver à une hauteur comprise entre 48 po [1220 mm] et 60 po [1525 mm] au-dessus du sol, mesurée jusqu'à la ligne de base des cellules braille.

source: Braille shall be below the corresponding text.
fr_ca: Le braille doit être situé sous le texte correspondant.

source: Braille shall be separated 3/8 inch (9.5 mm) minimum from any other raised characters and 3/8 inch (9.5 mm) minimum from raised borders and decorative elements.
fr_ca: Le braille doit être séparé d'au moins 3/8 po [9,5 mm] de tout autre caractère en relief et d'au moins 3/8 po [9,5 mm] des bordures en relief et des éléments décoratifs.

source: Building height, number of stories and building area provisions shall be applied independently.
fr_ca: Les dispositions relatives à la hauteur des bâtiments, au nombre d’étages et à la superficie des bâtiments doivent être appliquées indépendamment les unes des autres.

source: Buildings and facilities shall be designed and constructed to be accessible in accordance with this code and ICC A117.1.
fr_ca: Les bâtiments et les installations doivent être conçus et construits pour être accessibles conformément au présent code et à la norme ICC A117.1.

source: Buildings and structures designed to house special industrial processes that require large areas and unusual building heights to accommodate craneways or special machinery and equipment, including, among others, rolling mills; structural metal fabrication shops and foundries; or the production and distribution of electric, gas or steam power, shall be exempt from the building height, number of stories and building area limitations specified in Sections 504 and 506.
fr_ca: Les bâtiments et les constructions conçus pour abriter des procédés industriels spéciaux qui nécessitent de grandes superficies et des hauteurs de bâtiment inhabituelles pour permettre l’aménagement de chemins de roulement pour grues ou l’installation de machines et d’équipements spéciaux, notamment les laminoirs, les ateliers de fabrication de structures métalliques et les fonderies, ainsi que les installations de production et de distribution d’électricité, de gaz ou de vapeur, sont exemptés des limites de hauteur des bâtiments, de nombre d’étages et de superficie des bâtiments spécifiées aux sections 504 et 506.

source: Buildings and structures shall be equipped throughout with an automatic sprinkler system in accordance with Section 903.3.1.1 and a secondary water supply where required by Section 403.3.3.
fr_ca: Les bâtiments et constructions doivent être équipés dans leur ensemble d’un système d'extincteurs automatiques conforme à l’article 903.3.1.1 ainsi que d’une alimentation en eau secondaire lorsque celle-ci est exigée par l’article 403.3.3.

source: Buildings and structures where the area for the storage of tires exceeds 20,000 cubic feet (566 m3) shall be equipped throughout with an automatic sprinkler system in accordance with Section 903.3.1.1.
fr_ca: Les bâtiments et constructions où la superficie consacrée à l’entreposage de pneus dépasse 20 000 pieds cubes (566 m³) doivent être entièrement équipés d’un système d’extincteurs automatiques conformément à la section 903.3.1.1.

source: Buildings equipped throughout with an automatic sprinkler system in accordance with Section 903.3.1.1, provided that the occupant notification appliances will activate throughout the notification zones upon sprinkler waterflow.
fr_ca: Bâtiments entièrement équipés d’un système d’extincteurs automatiques conformément à la section 903.3.1.1, à condition que les avertisseurs du système de notification des occupants se déclenchent dans toutes les zones de notification dès qu’un débit d’eau est détecté dans le système d’extincteurs automatiques.

source: Buildings of Group R-1 containing not more than five sleeping units for rent or hire that are also occupied as the residence of the proprietor are not required to comply with this chapter.
fr_ca: Les bâtiments du groupe R-1 qui ne contiennent pas plus de cinq unités de couchage offertes en location ou en location à bail et qui sont également occupés comme résidence par le propriétaire-exploitant ne sont pas tenus d’être conformes au présent chapitre.

source: Buildings of Group R-4 shall be classified as one of the occupancy conditions specified in Section 310.5.1 or 310.5.2.
fr_ca: Les bâtiments du groupe R-4 doivent être classés dans l’une des catégories d’occupation spécifiées aux articles 310.5.1 ou 310.5.2.

source: Buildings of Type I construction permitted to be of unlimited tabular building heights and areas are not subject to the special requirements that allow unlimited area buildings in Section 507 or unlimited building height in Sections 503.1.1 and 504.3 or increased building heights and areas for other types of construction.
fr_ca: Les bâtiments de type I dont la hauteur et la superficie peuvent être illimitées selon les tableaux ne sont pas assujettis aux exigences particulières permettant une superficie illimitée des bâtiments en vertu de la section 507, ni à celles permettant une hauteur illimitée des bâtiments en vertu des sections 503.1.1 et 504.3, ni à celles permettant d’augmenter la hauteur et la superficie des bâtiments pour les autres types de construction.

source: Buildings or structures used for human occupancy shall have not less than one exterior door that meets the requirements of Section 1010.1.1.
fr_ca: Les bâtiments ou les structures destinés à l’occupation humaine doivent comporter au moins une porte extérieure conforme aux exigences de la section 1010.1.1.

source: Buildings that do not contain more than two dwelling units
fr_ca: Bâtiments ne contenant pas plus de deux logements

source: Built-in tubs with showers shall have waterproof joints between the tub and adjacent wall.
fr_ca: Les baignoires encastrées avec douche doivent avoir des joints étanches entre la baignoire et le mur adjacent.

source: Buttons with floor designations shall comply with Section 309.3.
fr_ca: Les boutons avec désignations d'étage doivent être conformes à la section 309.3.

source: Cabinetry shall be permitted under the lavatory provided the following criteria are met:
fr_ca: Les armoires sont autorisées sous le lavabo à condition que les critères suivants soient respectés :

source: Cabinetry shall be permitted under the lavatory, provided the following criteria are met:
fr_ca: Les armoires sont autorisées sous le lavabo, à condition que les critères suivants soient respectés :

source: Cabinetry shall be permitted under the work surface, provided the following criteria are met:
fr_ca: Les armoires sont autorisées sous le plan de travail, à condition que les critères suivants soient respectés :

source: Call buttons at elevator landings shall comply with Section 309.
fr_ca: Les boutons d'appel aux paliers d'ascenseur doivent être conformes à la section 309.

source: Call buttons shall be 3/4 inch (19 mm) minimum in their smallest dimension.
fr_ca: Les boutons d'appel doivent avoir une dimension minimale de 3/4 po [19 mm] dans leur plus petite dimension.

source: Call buttons shall be raised or flush.
fr_ca: Les boutons d'appel doivent être en saillie ou affleurants.

source: Call buttons shall have visible signals to indicate when each call is registered and when each call is answered.
fr_ca: Les boutons d'appel doivent avoir des signaux visibles pour indiquer quand chaque appel est enregistré et quand chaque appel reçoit une réponse.

source: Call buttons shall provide an audible signal or mechanical motion of the button to indicate when each call is registered.
fr_ca: Les boutons d'appel doivent émettre un signal sonore ou un mouvement mécanique du bouton pour indiquer quand chaque appel est enregistré.

source: Car doors shall be permitted to be located on adjacent sides of cars that provide an 18 square foot (1.67 m2) platform.
fr_ca: Les portes des cabines peuvent être situées sur les côtés adjacents des cabines qui offrent une plateforme de 18 pieds carrés (1,67 m2).

source: Car doors shall be positioned at the narrow end of cars with a single door and on cars with doors on opposite ends.
fr_ca: Les portes de la cabine doivent être placées à l'extrémité étroite des cabines à porte unique et sur les cabines dont les portes sont situées aux extrémités opposées.

source: Car doors shall comply with Section 408.3.3.
fr_ca: Les portes de cabine doivent être conformes à la section 408.3.3.

source: Car doors that provide a clear opening width of 36 inches (915 mm) minimum shall be permitted to be located on adjacent sides of cars that provide a clear floor area of 51 inches (1295 mm) in width and 51 inches (1295 mm) in depth.
fr_ca: Les portes de cabine qui offrent une largeur d'ouverture libre minimale de 36 po [915 mm] peuvent être situées sur les côtés adjacents des cabines qui offrent une surface de plancher libre de 51 po [1295 mm] de largeur et de 51 po [1295 mm] de profondeur.

source: Car emergency signaling devices complying with Section 407.4.10 shall be provided.
fr_ca: Des dispositifs de signalisation d'urgence de la cabine conformes à la section 407.4.10 doivent être prévus.

source: Car gates or doors positioned at a narrow end of the clear floor area required by Section 409.4.1 shall provide a clear opening width of 32 inches (815 mm) minimum.
fr_ca: Les barrières ou portes de cabine situées à une extrémité étroite de la surface de plancher libre requise par la section 409.4.1 doivent offrir une largeur d'ouverture libre minimale de 32 po [815 mm].

source: Car gates or doors positioned on adjacent sides shall provide a clear opening width of 42 inches (1065 mm) minimum.
fr_ca: Les barrières ou les portes de cabine situées sur les côtés adjacents doivent offrir une largeur d'ouverture libre minimale de 42 po [1065 mm].

source: Car identifications shall be located on both jambs of the hoistway immediately below the floor designation.
fr_ca: Les identifications de la cabine doivent être situées sur les deux montants de la cage d'ascenseur immédiatement en dessous de la désignation de l'étage.

source: Carbon monoxide alarm signals shall be automatically transmitted to an on-site location that is staffed by school personnel.
fr_ca: Les signaux d’alarme des détecteurs de monoxyde de carbone doivent être automatiquement transmis à un endroit sur place où du personnel de l’école est présent.

source: Carbon monoxide alarm signals shall not be required to be automatically transmitted to an on-site location that is staffed by school personnel in Group E occupancies with an occupant load of 30 or less.
fr_ca: Les signaux d’alarme des détecteurs de monoxyde de carbone ne sont pas tenus d’être automatiquement transmis à un endroit sur place où du personnel de l’école est présent dans les usages du groupe E dont la charge d’occupants est d’au plus 30 personnes.

source: Carbon monoxide alarms and carbon monoxide detection systems shall be maintained in accordance with the International Fire Code.
fr_ca: Les alarmes de monoxyde de carbone et les systèmes de détection de monoxyde de carbone doivent être entretenus conformément à l'International Fire Code.

source: Carbon monoxide alarms in dwelling units shall be installed outside of each separate sleeping area in the immediate vicinity of the bedrooms.
fr_ca: Les détecteurs de monoxyde de carbone dans les logements doivent être installés à l'extérieur de chaque espace de couchage séparé, à proximité immédiate des chambres à coucher.

source: Carbon monoxide alarms shall be listed in accordance with UL 2034.
fr_ca: Les alarmes de monoxyde de carbone doivent être répertoriées conformément à la norme UL 2034.
